Z_Old_Site/app/controllers/calls_controller.rb

SELECT "calls".* FROM "calls"
---
  def index
    @calls = Call.all

INSERT INTO "calls" ("address", "agency", "call_id", "call_type", "created_at", "last_updated", "latitude", "longitude", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @call = Call.new(call_params)

    respond_to do |format|
      if @call.save

UPDATE "calls" SET "address" = ?, "latitude" = ?, "longitude" = ?, "updated_at" = ? WHERE "calls"."id" = 3  [["address", "3300 ne 33rd ave., Portland, OR"], ["latitude", 45.5467522], ["longitude", -122.6306697], ["updated_at", Wed, 18 Dec 2013 20:53:49 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @call.update(call_params)

DELETE FROM "calls" WHERE "calls"."id" = ?  [["id", 2]]
---
  def destroy
    @call.destroy

SELECT "calls".* FROM "calls" WHERE "calls"."id" = ? LIMIT 1  [["id", "2"]]
---
    def set_call
      @call = Call.find(params[:id])